/*В программе объявлена переменная num с численным значением. 
Создайте функцию square(), которая возвращает квадрат этого числа.

Пример: 
let num = 5
let result = square(num) 
console.log(result)

Ответ: 25*/

let num = 5;

let square = function (num_2){    
    return num_2**2;  
}

console.log(square(num));

/* В программе объявлена переменная price, которая содержит в себе числовые данные. Опишите функцию priceMessage(), которая должна вывести в консоль сообщение по следующему примеру: 

price = 13000 
Результат "Данный товар стоит 13000 рублей"
*/

let price = 13000;
(function priceMessage(price_2){
    console.log('Данный товар стоит ' + price + ' рублей')
})()

/*В программе объявлена переменная num, которая содержит в себе численные данные. Напишите функцию power(), используя цикл, возведите значение переменной в квадрат 3 раза. Каждый результат сконкатенировать через пробел и выведите в консоль. пример: 
let num = 2
power(num)

Результат:  4 16 256*/


let num_3 = 2;

let power = function (num_4){ 
    let result = num_4;  
    for( i=3; i>0; i=i-1){
        result = result ** 2;
    console.log (result);
    }
} 
power(num_3);

/*В программе задана переменная num с числом. Напишите функцию handler, которая составит таблицу умножения с данным аргументом по следующему примеру:

handler(5)

Результат:

5*1=5
5*2=10
5*3=15
5*4=20
5*5=25
5*6=30
5*7=35
5*8=40
5*9=45
5*10=50*/

let num_5 = 5;

let handler = function (num_6){ 
    let result = 0;     
    for( i=1; i<=10; i++){
        result = num_6 * i;
    console.log (num_6 + '*' + i + '=' + result);
    }
} 
handler(num_5);